lvx/base/Documents/бит_ПротоколРасхожденийБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ПротоколРасхожденийБюджета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ПричиныРасхожденийБюджета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПлан</Name>
					<Comment>Сценарий бюджетирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийФакт</Name>
					<Comment>Сценарий бюджетирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Comment>Настройка протокола расхождения бюджета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиПротоколовРасхожденийБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>Бюджет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Comment>ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиСхемы</Name>
					<Comment>Настройки схемы компоновки данных</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеБюджета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Comment>Период</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Comment>Статья оборотов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Comment>ЦФО</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>Договор контрагента</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Comment>Проект</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Comment>Номенклатурная группа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Comment>Банковский счет</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Comment>Дополнительная аналитика № 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Comment>Дополнительная аналитика № 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Comment>Дополнительная аналитика № 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Comment>Дополнительная аналитика № 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5</Name>
							<Comment>Дополнительная аналитика № 5</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6</Name>
							<Comment>Дополнительная аналитика № 6</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8</Name>
							<Comment>Дополнительная аналитика № 8</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9</Name>
							<Comment>Дополнительная аналитика № 9</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10</Name>
							<Comment>Дополнительная аналитика № 10</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11</Name>
							<Comment>Дополнительная аналитика № 11</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12</Name>
							<Comment>Дополнительная аналитика № 12</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеглПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпрПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСценарийПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеглФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпрФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСценарийФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОтклонениеАбс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеглОтклонениеАбс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпрОтклонениеАбс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСценарийОтклонениеАбс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОтклонениеОтн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеглОтклонениеОтн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпрОтклонениеОтн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСценарийОтклонениеОтн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаРасхождений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныРасхожденийБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Documents/бит_ПротоколРасхожденийБюджета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//   Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
//   Реквизиты - Массив - список имен реквизитов объекта.
//
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("НаборыЗначенийДоступа.*");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Протокол по всем ЦФО.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор				= "ПротоколПоВсемЦФО";
	КомандаПечати.Представление				= НСтр("ru='Протокол по всем ЦФО';en='Protocol for All Responsibility Centers'");
	Если НЕ бит_ОбщегоНазначения.ЭтоУТ() Тогда
		КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КонецЕсли;
	КомандаПечати.ДополнительныеПараметры   = Новый Структура("ИмяМакета", "ПротоколПоВсемЦФО");
	КомандаПечати.Порядок					= 10;	
	
	// Протокол по каждому ЦФО.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор				= "ПротоколПоКаждомуЦФО";
	КомандаПечати.Представление				= НСтр("ru='Протокол по каждому ЦФО';en='Protocol for Every Responsibility Center'");
	Если НЕ бит_ОбщегоНазначения.ЭтоУТ() Тогда
		КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КонецЕсли;
	КомандаПечати.ДополнительныеПараметры   = Новый Структура("ИмяМакета", "ПротоколПоКаждомуЦФО");
	КомандаПечати.Порядок					= 20;	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПротоколПоВсемЦФО") Тогда					
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
					"ПротоколПоВсемЦФО",
					НСтр("ru='Протокол по всем ЦФО';en='Protocol for All Responsibility Centers'"), 
					СформироватьПечатнуюФормуПротоколРасхождений(МассивОбъектов, ПараметрыПечати),,
					"Документ.бит_ПротоколРасхожденийБюджета.ПротоколПоВсемЦФО");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПротоколПоКаждомуЦФО") Тогда					
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
					"ПротоколПоКаждомуЦФО",
					НСтр("ru='Протокол по каждому ЦФО';en='Protocol for Every Responsibility Center'"), 
					СформироватьПечатнуюФормуПротоколРасхождений(МассивОбъектов, ПараметрыПечати),,
					"Документ.бит_ПротоколРасхожденийБюджета.ПротоколПоКаждомуЦФО");
	КонецЕсли;
	
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);		

КонецПроцедуры

// СтандартныеПодсистемы.Печать

// Функция определяет новый статус объекта.
// Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_ПротоколРасхожденийБюджета.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_СтатусыОбъектов - новый статус объекта.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Возврат бит_ВизированиеСервер.НовыйСтатусПоСтандартномуАлгоритму(ТекущийОбъект, ПараметрыУстановкиСтатуса);
	
КонецФункции

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт

	Совместимо = Истина;
	
КонецПроцедуры

// Функция подготавливает параметры проведения.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.бит_ПротоколРасхожденийБюджета - ссылка на документ.
//  Отказ          - Булево - признак обнаружения ошибки и отказа от дальнейших действий.
//
// Возвращаемое значение:
//  Структура - структура параметров проведения.
//
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.СценарийПлан КАК СценарийПлан,
	|	Реквизиты.СценарийФакт КАК СценарийФакт
	|ИЗ
	|	Документ.бит_ПротоколРасхожденийБюджета КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить().Выгрузить();
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	
	Если НЕ бит_ОбщегоНазначения.ВалютаУпрУчетаУстановлена(Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;

	Запрос = Новый Запрос(); 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.УстановитьПараметр("ИмяСписка", "УвеличениеЛимита"); 
	Запрос.УстановитьПараметр("СинонимСписка", НСтр("ru = 'Данные бюджета'; en = 'Budget Data'"));
	
	НомераТаблиц = Новый Структура(); 
	ТекстЗапроса = ТекстЗапросаПричиныРасхожденийБюджета(НомераТаблиц); 
				 			 
	Запрос.Текст = ТекстЗапроса;
	Результат 	 = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла; 	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
		
	Возврат ПараметрыПроведения;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьПричиныРасхожденийБюджета(ПричиныРасхожденийБюджета, 
			ПричиныРасхожденийБюджетаРеквизиты, Движения) Экспорт

	Если НЕ ЗначениеЗаполнено(ПричиныРасхожденийБюджета) 
     ИЛИ НЕ ЗначениеЗаполнено(ПричиныРасхожденийБюджетаРеквизиты) Тогда
		Возврат;
	КонецЕсли;

	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ПричиныРасхожденийБюджетаРеквизиты[0]);
	
	Проводки = Движения.бит_ПричиныРасхожденийБюджета;
	Проводки.Записывать = Истина;
	
	Для каждого СтрокаТаблицы Из ПричиныРасхожденийБюджета Цикл
		Проводка = Проводки.Добавить();
		ЗаполнитьЗначенияСвойств(Проводка, СтрокаТаблицы);
		ЗаполнитьЗначенияСвойств(Проводка, Реквизиты);
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьДанныеБюджета(ДанныеОбъекта) Экспорт
	
	НастройкиПротокола = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеОбъекта.Настройка, 
							"ТекстЗапроса, Периодичность, Бюджет, НастройкаСхемы");
	
	// Копирование отбора из настройки.
	СохраненнаяНастройка = НастройкиПротокола.НастройкаСхемы.Получить();
	Если ТипЗнч(СохраненнаяНастройка) <> Тип("Структура") Тогда
		СохраненнаяНастройка = Новый Структура;
	КонецЕсли; 	
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Если СохраненнаяНастройка.Свойство("НастройкиКомпоновщика") 
		И ТипЗнч(СохраненнаяНастройка.НастройкиКомпоновщика) = Тип("НастройкиКомпоновкиДанных")  Тогда
		Компоновщик.ЗагрузитьНастройки(СохраненнаяНастройка.НастройкиКомпоновщика);
	КонецЕсли; 
	
	ТекстЗапроса	= НастройкиПротокола.ТекстЗапроса;
	АдресКомпоновки = Справочники.бит_НастройкиПротоколовРасхожденийБюджета.ИнициализироватьКомпоновщик(ТекстЗапроса, 
						Компоновщик, Новый УникальныйИдентификатор);	
	
	СКД = ПолучитьИзВременногоХранилища(АдресКомпоновки);
	
	НастройкиКомпоновщика = Компоновщик.ПолучитьНастройки();
	
	КоллекцияВыбранныхПолей = НастройкиКомпоновщика.Выбор.Элементы;
	Для каждого ВыбранноеПоле Из КоллекцияВыбранныхПолей Цикл
		Если ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Валюта")
			ИЛИ ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Регистратор") Тогда			
			ВыбранноеПоле.Использование = Ложь;
		КонецЕсли; 
	КонецЦикла;
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетСКД = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СКД, НастройкиКомпоновщика);
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("ВалютаСценария"		, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.СценарийФакт, "Валюта"));
	Запрос.Параметры.Вставить("ВалютаСценарияЭталон", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.СценарийПлан, "Валюта"));
	Запрос.Параметры.Вставить("НачалоПериода"		, ДанныеОбъекта.ДатаНачала);
	Запрос.Параметры.Вставить("КонецПериода"		, КонецДня(ДанныеОбъекта.ДатаОкончания));
	Запрос.Параметры.Вставить("Сценарий"			, ДанныеОбъекта.СценарийФакт);
	Запрос.Параметры.Вставить("СценарийЭталон"		, ДанныеОбъекта.СценарийПлан);
	Запрос.Параметры.Вставить("Периодичность"		, НастройкиПротокола.Периодичность);
	Если ЗначениеЗаполнено(НастройкиПротокола.Бюджет) Тогда
		Запрос.Параметры.Вставить("Бюджет", НастройкиПротокола.Бюджет);
	КонецЕсли; 
	Попытка
		Запрос.Текст = МакетСКД.НаборыДанных.НаборДанныхОсновной.Запрос;
		Справочники.бит_НастройкиПротоколовРасхожденийБюджета.ДобавитьТекстСортировки(Запрос.Текст, 
						НастройкиПротокола.НастройкаСхемы, ЗначениеЗаполнено(НастройкиПротокола.Бюджет));
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось установить отбор для получения дерева.';
							  |en='Failed to set the selection for the tree.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	// Устанавливаем параметры запроса.
	ОписаниеПараметровЗапроса = Запрос.НайтиПараметры();
	Для каждого ОписаниеПараметраЗапроса Из ОписаниеПараметровЗапроса Цикл
		Если МакетСКД.ЗначенияПараметров.Найти(ОписаниеПараметраЗапроса.Имя) <> Неопределено Тогда
			Запрос.УстановитьПараметр(ОписаниеПараметраЗапроса.Имя, МакетСКД.ЗначенияПараметров[ОписаниеПараметраЗапроса.Имя].Значение);
		КонецЕсли; 
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	ДанныеБюджета  = Новый ТаблицаЗначений;
	КолонкиТаблицы = Метаданные.Документы.бит_ПротоколРасхожденийБюджета.ТабличныеЧасти.ДанныеБюджета.Реквизиты;
	Для каждого ОписаниеКолонки Из КолонкиТаблицы Цикл
		ДанныеБюджета.Колонки.Добавить(ОписаниеКолонки.Имя, ОписаниеКолонки.Тип);
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
		// Не выводим строки с нулевым отклонением регл.
		Если (Выборка.СуммаРеглФакт - Выборка.СуммаРеглПлан) = 0 Тогда
			Продолжить;
		КонецЕсли; 
		ЗаполнитьЗначенияСвойств(ДанныеБюджета.Добавить(), Выборка);
	КонецЦикла;
	
	Возврат ДанныеБюджета;
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПричиныРасхожденийБюджета(НомераТаблиц)

	НомераТаблиц.Вставить("ПричиныРасхожденийБюджетаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПричиныРасхожденийБюджета", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.СценарийПлан КАК СценарийПлан,
	|	Реквизиты.СценарийФакт КАК СценарийФакт
	|ИЗ
	|	Документ.бит_ПротоколРасхожденийБюджета КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ИмяСписка КАК ИмяСписка,
	|	&СинонимСписка КАК СинонимСписка,
	|	ПричиныРасхожденийБюджета.НомерСтроки КАК НомерСтроки,
	|	ПричиныРасхожденийБюджета.Период КАК Период,
	|	ПричиныРасхожденийБюджета.СтатьяОборотов КАК СтатьяОборотов,
	|	ПричиныРасхожденийБюджета.ЦФО КАК ЦФО,
	|	ПричиныРасхожденийБюджета.КоличествоПлан КАК КоличествоПлан,
	|	ПричиныРасхожденийБюджета.СуммаРеглПлан КАК СуммаРеглПлан,
	|	ПричиныРасхожденийБюджета.СуммаУпрПлан КАК СуммаУпрПлан,
	|	ПричиныРасхожденийБюджета.СуммаСценарийПлан КАК СуммаСценарийПлан,
	|	ПричиныРасхожденийБюджета.КоличествоФакт КАК КоличествоФакт,
	|	ПричиныРасхожденийБюджета.СуммаРеглФакт КАК СуммаРеглФакт,
	|	ПричиныРасхожденийБюджета.СуммаУпрФакт КАК СуммаУпрФакт,
	|	ПричиныРасхожденийБюджета.СуммаСценарийФакт КАК СуммаСценарийФакт,
	|	ПричиныРасхожденийБюджета.КоличествоОтклонениеАбс КАК КоличествоОтклонениеАбс,
	|	ПричиныРасхожденийБюджета.СуммаРеглОтклонениеАбс КАК СуммаРеглОтклонениеАбс,
	|	ПричиныРасхожденийБюджета.СуммаУпрОтклонениеАбс КАК СуммаУпрОтклонениеАбс,
	|	ПричиныРасхожденийБюджета.СуммаСценарийОтклонениеАбс КАК СуммаСценарийОтклонениеАбс,
	|	ПричиныРасхожденийБюджета.КоличествоОтклонениеОтн КАК КоличествоОтклонениеОтн,
	|	ПричиныРасхожденийБюджета.СуммаРеглОтклонениеОтн КАК СуммаРеглОтклонениеОтн,
	|	ПричиныРасхожденийБюджета.СуммаУпрОтклонениеОтн КАК СуммаУпрОтклонениеОтн,
	|	ПричиныРасхожденийБюджета.СуммаСценарийОтклонениеОтн КАК СуммаСценарийОтклонениеОтн,
	|	ПричиныРасхожденийБюджета.ПричинаРасхождений КАК ПричинаРасхождений,
	|	ПричиныРасхожденийБюджета.Комментарий КАК Комментарий,
	|	ПричиныРасхожденийБюджета.Аналитика_1 КАК Аналитика_1,
	|	ПричиныРасхожденийБюджета.Аналитика_2 КАК Аналитика_2,
	|	ПричиныРасхожденийБюджета.Аналитика_3 КАК Аналитика_3,
	|	ПричиныРасхожденийБюджета.Аналитика_4 КАК Аналитика_4,
	|	ПричиныРасхожденийБюджета.Аналитика_5 КАК Аналитика_5,
	|	ПричиныРасхожденийБюджета.Аналитика_6 КАК Аналитика_6,
	|	ПричиныРасхожденийБюджета.Аналитика_7 КАК Аналитика_7,
	|	ПричиныРасхожденийБюджета.Аналитика_8 КАК Аналитика_8,
	|	ПричиныРасхожденийБюджета.Аналитика_9 КАК Аналитика_9,
	|	ПричиныРасхожденийБюджета.Аналитика_10 КАК Аналитика_10,
	|	ПричиныРасхожденийБюджета.Аналитика_11 КАК Аналитика_11,
	|	ПричиныРасхожденийБюджета.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	Документ.бит_ПротоколРасхожденийБюджета.ДанныеБюджета КАК ПричиныРасхожденийБюджета
	|ГДЕ
	|	ПричиныРасхожденийБюджета.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

// Функция формирует печатную форму Протокола расхождений бюджета.
// 
// Параметры:
//  МассивСсылок 	- Массив.
// 	ПараметрыПечати - Структура.
// 
// Возвращаемое значение:
//  ТабличныйДокумент - ТабличныйДокумент.
// 
Функция СформироватьПечатнуюФормуПротоколРасхождений(МассивСсылок, ПараметрыПечати)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Формируем запрос по заявкам.
	Результат 			= ПолучитьРезультатЗапросаПоПротоколу(МассивСсылок);
	РезультатЗапроса 	= Результат.Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда
		
		// Получаем макет и области.
		Макет = ПолучитьМакет(ПараметрыПечати.ИмяМакета);
		
		Если ВРег(ПараметрыПечати.ИмяМакета) = ВРег("ПротоколПоКаждомуЦФО") Тогда
		
			ТаблицаЦФО = РезультатЗапроса.Скопировать();
			ТаблицаЦФО.Свернуть("ЦФО");
			
			Для каждого стрЦФО Из ТаблицаЦФО Цикл
				ЗаполнениеМакета(Макет, ТабличныйДокумент, РезультатЗапроса, стрЦФО.ЦФО);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЦикла; 
			
		Иначе	
			ЗаполнениеМакета(Макет, ТабличныйДокумент, РезультатЗапроса);
		КонецЕсли; 
		
	КонецЕсли;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
			
КонецФункции

// Процедура заполняет макет. 
//
Процедура ЗаполнениеМакета(Макет, ТабличныйДокумент, РезультатЗапроса, стрЦФО=Неопределено)

	// Получаем области
	ОбластьПротоколШапка 		= Макет.ПолучитьОбласть("ПротоколШапка");
	ОбластьПодвал 				= Макет.ПолучитьОбласть("Подвал");
	
	// Области табличной части документа.
	Области = Новый Структура;
	Области.Вставить("Шапка_Лево"		,Макет.ПолучитьОбласть("ДанныеБюджетаШапка|ОбластьЛево"));
	Области.Вставить("Шапка_Центр"		,Макет.ПолучитьОбласть("ДанныеБюджетаШапка|ОбластьЦентр"));
	Области.Вставить("Шапка_Право"   	,Макет.ПолучитьОбласть("ДанныеБюджетаШапка|ОбластьПраво"));		
	Области.Вставить("Значение_Лево" 	,Макет.ПолучитьОбласть("ДанныеБюджета|ОбластьЛево"));
	Области.Вставить("Значение_Центр"	,Макет.ПолучитьОбласть("ДанныеБюджета|ОбластьЦентр"));
	Области.Вставить("Значение_Право"	,Макет.ПолучитьОбласть("ДанныеБюджета|ОбластьПраво"));		
	
	
	ТаблицаДокументы = РезультатЗапроса.Скопировать();
	ТаблицаДокументы.Свернуть("Ссылка");
	
	Для каждого Документ Из ТаблицаДокументы Цикл
		
		ПротоколРасхождений = Документ.Ссылка;
		
		СтрОтбор = Новый Структура;
		СтрОтбор.Вставить("Ссылка", ПротоколРасхождений);
		Если стрЦФО <> Неопределено Тогда
		
			СтрОтбор.Вставить("ЦФО", стрЦФО);
		
		КонецЕсли; 
		
		МассивСтрок = РезультатЗапроса.НайтиСтроки(СтрОтбор);
		
		Если МассивСтрок.количество()=0 Тогда
			Продолжить;
		КонецЕсли; 
		
		ОбластьПротоколШапка.Параметры.Заполнить(МассивСтрок[0]);
		
		ТабличныйДокумент.Вывести(ОбластьПротоколШапка);
		
		ТабДокШапка = Новый ТабличныйДокумент;
		
		ТабДокШапка.Присоединить(Области.Шапка_Лево);
		
		ИзмеренияДоп = бит_Бюджетирование.НастройкиИзмеренийБюджетирования();
		
		// Не рисуем колонки с незаполненными значениями
		МассивПустыхКолонок = Новый Массив;
		Для каждого Аналитика Из Документ.Ссылка.Настройка.Измерения Цикл
			
			Если Аналитика.Выполнять Тогда
				
				Табл = РезультатЗапроса.Скопировать(,Аналитика.Имя);
				Табл.Свернуть(Аналитика.Имя);
				Если Табл.Количество()=1
					И НЕ ЗначениеЗаполнено(Табл[0][Аналитика.Имя]) Тогда
					МассивПустыхКолонок.Добавить(Аналитика.Имя);
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;	
				
		Для каждого Аналитика Из Документ.Ссылка.Настройка.Измерения Цикл
			
			Если Аналитика.Выполнять Тогда
				
				Области.Шапка_Центр.Параметры.Аналитика = ИзмеренияДоп[Аналитика.Имя].Синоним;
				
				Если МассивПустыхКолонок.Найти(Аналитика.Имя)=Неопределено Тогда
					ТабДокШапка.Присоединить(Области.Шапка_Центр);
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
		
		ТабДокШапка.Присоединить(Области.Шапка_Право);
		ТабличныйДокумент.Вывести(ТабДокШапка);
		
		Для каждого СтрокаТЧ Из МассивСтрок Цикл
			
			ТабДок = Новый ТабличныйДокумент;
			
			Области.Значение_Лево.Параметры.Заполнить(СтрокаТЧ);
			Области.Значение_Право.Параметры.Заполнить(СтрокаТЧ);
			
			ТабДок.Присоединить(Области.Значение_Лево);
			
			Для каждого Аналитика Из Документ.Ссылка.Настройка.Измерения Цикл
				
				Если Аналитика.Выполнять Тогда
					
					Области.Значение_Центр.Параметры.ЗначениеАналитики = СтрокаТЧ[Аналитика.Имя];
					
					Если МассивПустыхКолонок.Найти(Аналитика.Имя)=Неопределено Тогда
						ТабДок.Присоединить(Области.Значение_Центр);
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла; 
			
			ТабДок.Присоединить(Области.Значение_Право);
			ТабличныйДокумент.Вывести(ТабДок);
			
		КонецЦикла; 
		
		ОбластьПодвал.Параметры.Заполнить(МассивСтрок[0]);
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла; 

КонецПроцедуры

// Функция получает результат запроса по массиву документов.
// 
// Параметры:
//  МассивСсылок - Массив
// 
// Возвращаемое значение:
//  Результат - ТаблицаЗначений.
// 
Функция ПолучитьРезультатЗапросаПоПротоколу(МассивСсылок)

	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРеглУчета);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК ДатаДокумента,
	|	Реквизиты.СценарийПлан КАК СценарийПлан,
	|	Реквизиты.СценарийФакт КАК СценарийФакт,
	|	Реквизиты.Настройка КАК Настройка,
	|	Реквизиты.Бюджет КАК Бюджет,
	|	Реквизиты.ДатаНачала КАК ДатаНачала,
	|	Реквизиты.ДатаОкончания КАК ДатаОкончания,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Период КАК Период,
	|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
	|	Таблица.ЦФО КАК ЦФО,
	|	Таблица.КоличествоПлан КАК КоличествоПлан,
	|	Таблица.СуммаРеглПлан КАК СуммаРеглПлан,
	|	Таблица.СуммаУпрПлан КАК СуммаУпрПлан,
	|	Таблица.СуммаСценарийПлан КАК СуммаСценарийПлан,
	|	Таблица.КоличествоФакт КАК КоличествоФакт,
	|	Таблица.СуммаРеглФакт КАК СуммаРеглФакт,
	|	Таблица.СуммаУпрФакт КАК СуммаУпрФакт,
	|	Таблица.СуммаСценарийФакт КАК СуммаСценарийФакт,
	|	Таблица.КоличествоОтклонениеАбс КАК КоличествоОтклонениеАбс,
	|	Таблица.СуммаРеглОтклонениеАбс КАК СуммаРеглОтклонениеАбс,
	|	Таблица.СуммаУпрОтклонениеАбс КАК СуммаУпрОтклонениеАбс,
	|	Таблица.СуммаСценарийОтклонениеАбс КАК СуммаСценарийОтклонениеАбс,
	|	Таблица.КоличествоОтклонениеОтн КАК КоличествоОтклонениеОтн,
	|	Таблица.СуммаРеглОтклонениеОтн КАК СуммаРеглОтклонениеОтн,
	|	Таблица.СуммаУпрОтклонениеОтн КАК СуммаУпрОтклонениеОтн,
	|	Таблица.СуммаСценарийОтклонениеОтн КАК СуммаСценарийОтклонениеОтн,
	|	Таблица.ПричинаРасхождений КАК ПричинаРасхождений,
	|	Таблица.Комментарий КАК Комментарий,
	|	Реквизиты.Ответственный КАК Ответственный,
	|	&ВалютаРеглУчета КАК Валюта,
	|	Таблица.Аналитика_1 КАК Аналитика_1,
	|	Таблица.Аналитика_2 КАК Аналитика_2,
	|	Таблица.Аналитика_3 КАК Аналитика_3,
	|	Таблица.Аналитика_4 КАК Аналитика_4,
	|	Таблица.Аналитика_5 КАК Аналитика_5,
	|	Таблица.Аналитика_6 КАК Аналитика_6,
	|	Таблица.Аналитика_7 КАК Аналитика_7,
	|	Таблица.Аналитика_8 КАК Аналитика_8,
	|	Таблица.Аналитика_9 КАК Аналитика_9,
	|	Таблица.Аналитика_10 КАК Аналитика_10,
	|	Таблица.Аналитика_11 КАК Аналитика_11,
	|	Таблица.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	Документ.бит_ПротоколРасхожденийБюджета КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ПротоколРасхожденийБюджета.ДанныеБюджета КАК Таблица
	|		ПО Реквизиты.Ссылка = Таблица.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка В(&МассивСсылок)";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
